app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
    @stocks = Stock.all
---
SELECT * FROM `ideas`
SELECT * FROM `stocks`

  def show
    @idea = Idea.find(params[:id], :include => {:comments => []})
---
SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)

  def new
    @stock1 = Stock.find(params[:stock_id])
---
SELECT * FROM `stocks` WHERE (`stocks`.`id` = 2)

  def edit
    @idea = Idea.find(params[:id])
---
SELECT * FROM `ideas` WHERE (`ideas`.`id` = 3)

  def create
    @idea = Idea.new(params[:idea])
    stock = Stock.find(params[:stock_id])
    user = User.find(params[:user_id])
    @idea.user = user
    @idea.stock = stock

    respond_to do |format|
      if @idea.save
---
SELECT * FROM `stocks` WHERE (`stocks`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `ideas` (`updated_at`, `title`, `description`, `price_target`, `user_id`, `stock_id`, `created_at`) VALUES('2010-09-08 02:07:24', 'sell', '<p>sell this thing</p>', NULL, 1, NULL, '2010-09-08 02:07:24')

  def destroy
    @idea = Idea.find(params[:id])
    @idea.destroy
---
SELECT * FROM `ideas` WHERE (`ideas`.`id` = 1)
DELETE FROM `ideas` WHERE `id` = 1