app/controllers/stocks_controller.rb

SELECT * FROM `stocks` WHERE (ticker LIKE '%aapl%')
---
  def search
  	@stocks = Stock.search params[:search]

SELECT * FROM `stocks`
---
  def index
    @stocks = Stock.all

SELECT * FROM `stocks` WHERE (`stocks`.`id` = 1)
SELECT * FROM `ideas` WHERE (`ideas`.`stock_id` = 1)
---
  def show
    @stock = Stock.find(params[:id])
    @tests = Idea.find_all_by_stock_id(@stock)

INSERT INTO `stocks` (`updated_at`, `ticker`, `created_at`) VALUES('2010-08-07 20:24:18', 'AAPL', '2010-08-07 20:24:18')
---
  def create
    @stock = Stock.new(params[:stock])
    respond_to do |format|
      if @stock.save

SELECT * FROM `stocks` WHERE (`stocks`.`id` = 5)
DELETE FROM `stocks` WHERE `id` = 5
---
  def destroy
    @stock = Stock.find(params[:id])
    @stock.destroy