app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `ideas` WHERE (`ideas`.`user_id` = 1)
---
  def show
    @user = User.find(params[:id])
    @tests = Idea.find_all_by_user_id(@user)

INSERT INTO `users` (`last_login_at`, `updated_at`, `last_request_at`, `crypted_password`, `current_login_ip`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `login`, `created_at`, `email`, `last_login_ip`) VALUES(NULL, '2010-09-18 09:05:48', '2010-09-18 09:05:48', '6a59ec0a42c7041ac2b3388944c18f8757518c322d61976982e777a85a773217bb2d979bb5e26d3c7ced186512a33553a4ec92fbfd02b8d70116359816c5e8a9', '127.0.0.1', 'N7Ksug5wQzhHn7SqceB', '2010-09-18 09:05:48', '97ac7f8d385e2258e4cbac6f22292d9b03662576bd32b0360d770e8ce413d072e5cf964194ca2327860812c2838a438837857b87496485250e74070e4bcce1ea', 1, 'pavit', '2010-09-18 09:05:48', 'pavitm@gmail.com', NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def update
    @user = User.find(params[:id])